# Задание 1
# Необходимо вывести имена всех учеников из списка с новой строки

names = ['Оля', 'Петя', 'Вася', 'Маша']

for print_name in names:
    print(print_name)

# Задание 2
# Необходимо вывести имена всех учеников из списка, рядом с именем показать количество букв в нём.

names = ['Оля', 'Петя', 'Вася', 'Маша']

for print_name in names:
    print(print_name,len(print_name))


# Задание 3
# Необходимо вывести имена всех учеников из списка, рядом с именем вывести пол ученика

is_male = {
  'Оля': False,  # если True, то пол мужской
  'Петя': True,
  'Вася': True,
  'Маша': False,
}
names = ['Оля', 'Петя', 'Вася', 'Маша']

for check_dict in names:
    if check_dict in is_male:
        if is_male[check_dict] == False:
            print(check_dict,'Женщина')
        if is_male[check_dict] == True:
            print(check_dict,'Мужчина')


# Задание 4
# Даны группу учеников. Нужно вывести количество групп и для каждой группы – количество учеников в ней
# Пример вывода:
# Всего 2 группы.
# В группе 2 ученика.
# В группе 3 ученика.

groups = [
  ['Вася', 'Маша'],
  ['Оля', 'Петя', 'Гриша'],
]

number_group = 0

for a in groups:
    number_group += 1
print("Всего {} группы.".format(number_group))

for b in groups:
    print('В группе {} ученика.'.format(len(b)))



# Задание 5
# Для каждой пары учеников нужно с новой строки перечислить учеников, которые в неё входят.
# Пример:
# Группа 1: Вася, Маша
# Группа 2: Оля, Петя, Гриша

groups = [
    ['Вася', 'Маша'],
    ['Оля', 'Петя', 'Гриша'],
]
num_gr =0
for a in groups:
    num_gr += 1
    print("Группа {}:".format(num_gr),' '.join(a))